#Step 2: Variable assiment
my_var1  <- 42      # my_var1 тепер дрівнює 42
my_var2  <- 35.25   # my_var2 тепер дрівнює 35.25

my_var1 + 100                     # надрукує 142
my_var1 + my_var2 - 12            # надрукує 65.25
my_var3  <- my_var1^2 + my_var2^2 # my_var3 тепер дрівнює 3006.562

#Step 3: Logical opperartions
my_var3 > 200                     # надрукує TRUE
my_var3 > 3009                    # надрукує FALSE
my_var1 == my_var2                # надрукує FALSE
my_var1 != my_var2                # надрукує TRUE
my_var3 >= 200                    # надрукує TRUE
my_var3 <= 200                    # надрукує FALSE

my_new_var  <- my_var1 == my_var2 # my_new_var3 тепер дрівнює FALSE


#Step 6, 7, 10, 11: Vectors
1 : 67                 # надрукує вектор з 67-и компонен від 1-го до 67-и 
my_vector1  <- 1:67    # my_vector1 тепер дрівнює вектору з 67-и компонент від 1-го до 67-и
my_vector2  <- c(-32, 45, 67, 12.78, 129, 0, -65) # my_vector1 тепер дрівнює вектору з вказаних комронент

my_vector1[1]  # надрукує 1
my_vector1[3]  # надрукує 3

my_vector2[2]  # надрукує 45

my_vector2[c(1,2,3)]  # надрукує вектор з трех компонент, які є 1-м, 2-м, 3-м компонентами вектора my_vector2
my_vector2[1:3] # надрукує вектор з трех компонент, які є першими трьома компонентами вектора my_vector2
my_vector2[c(1,5,6,7,10)] # надрукує вектор з 5-и компонент згідно вказаних індексів (5-а компонента буде NA, бо у векторі my_vector2 нема 10-ї компоненти)

my_vector1 + 10 # надрукує вектор, де кожна компонента вектора my_vector1 збільшена на 10
my_vector2 + 56 # надрукує вектор, де кожна компонента вектора my_vector2 збільшена на 56

my_vector2 == 0 # надрукує вектор, логічних значень порівяння компонент з нулем
my_vector1 > 30 # надрукує вектор, логічних значень, де TRUE, якщо компонента більша за 30, інакше FALSE

x  <- 23        # x тепер дрівнює 23
my_vector1 > 23  # надрукує вектор, логічних значень, де TRUE, якщо компонента більша за 23, інакше FALSE
x == 23         # надрукує TRUE

my_vector2 > 0 # надрукує вектор, логічних значень, де TRUE, якщо компонента більша за 0, інакше FALSE
my_vector2[my_vector2 > 0] # надрукує вектор з компонент вектора my_vector2, які більші нуля
my_vector2[my_vector2 < 0] # надрукує вектор з компонент вектора my_vector2, які менші нуля
my_vector2[my_vector2 == 0] # надрукує вектор з компонент вектора my_vector2, які дорівнюють нулю

my_vector1[my_vector1 > 20 & my_vector1 < 30] # надрукує вектор з компонент вектора my_vector1, які більші 20 та менші 30
my_numbers  <- my_vector1[my_vector1 > 20 & my_vector1 < 30] # my_numbers тепер вектор з компонент вектора my_vector1, які більші 20 та менші 30
positive_numbers  <- my_vector2[my_vector2 > 0] # positive_numbers тепер вектор з компонент вектора my_vector2, які більші нуля


v1  <- c(165, 178, 180, 181, 167, 178, 187, 167, 187) # v1 - вектор з вкащаних компонент
mean_v1  <- mean(v1) # mean_v1 - середнє значення компонент вектора v1
v1[v1 > mean_v1]     # надрукує вектор компонент з v1, які більще середнього
greater_than_mean  <- v1[v1 > mean_v1] # запишем те саме з змінну greater_than_mean


#Step 13: Lists and dataframes
age  <- c(16, 18, 22, 27)      # список значень віку
is_maried  <- c(F, F, T, T)    # список сімейного стану 
name  <- c("Olga", "Maria", "Nastya", "Polina") # список імен

my_data  <- data.frame(Name = name, Age = age, Status = is_maried) # таблиця, де стовпчики вказані списки значень